# SystemId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarInSystem..::..SystemId Property
RebarInSystem Class See Also
---
The Id of an AreaReinforcement or PathReinforcement element that owns this element.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ElementId SystemId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SystemId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ SystemId {
	ElementId^ get ();
}
```

# See Also
RebarInSystem Class
Autodesk.Revit.DB.Structure Namespace